#pragma once

#include <sausage.h>
#include <OpenGLHelpers.h>
#include <assert.h>

using namespace std;
using namespace glm;

class GLHelpersTest {
public:
  static void run() {
    //assert(GetPadCharsNumToLargestElement(2, sizeof(vec4), sizeof(vec4)) == 0);
    //assert(GetPadCharsNumToLargestElement(2, sizeof(vec4), sizeof(int)) == 12);
    //assert(GetPadCharsNumToLargestElement(2, sizeof(vec4), sizeof(char)) == 15);
    //assert(GetPadCharsNumToLargestElement(3, sizeof(vec4), sizeof(char), sizeof(int)) == 11);

    //assert(GetPadCharsNumToLargestElement({ sizeof(vec4), sizeof(vec4) }) == 0);
    //assert(GetPadCharsNumToLargestElement({sizeof(vec4), sizeof(int)}) == 12);
    //assert(GetPadCharsNumToLargestElement({sizeof(vec4), sizeof(char)}) == 15);
    //assert(GetPadCharsNumToLargestElement({sizeof(vec4), sizeof(char), sizeof(int)}) == 11);
  };
};
